Revit 2027 API
MasonryCMU.MasonryCMUPatternMap Property
 The property labeled "Image" from the "MasonryCMU" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MasonryCMUPatternMap { get; }
Public Shared ReadOnly Property MasonryCMUPatternMap As String
	Get
public:
static property String^ MasonryCMUPatternMap {
	String^ get ();
}
static member MasonryCMUPatternMap : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
See Also
Reference
MasonryCMU Class
Autodesk.Revit.DB.Visual Namespace